import matplotlib.pyplot as plt
import numpy as np

# Pcolormesh - всевдоцветная сетка.

# Массив цветов
c = [[0, 1, 2, 3], [4, 5, 6, 7], [8, 9, 10, 11], [12, 13, 14, 15]]

fig, ax = plt.subplots(2, 2)
ax[0][0].pcolormesh(c)

c2 = [[5, 1, 2], [2, 8, 0], [1, 0, 12]]

# Условно говоря здесь отмечаются точки по оси х и у и проводятся
# соответствующие линии - так получается сетака.
x = [0, 2, 4, 7]
y = [3, 4, 6, 9]
ax[0][1].pcolormesh(x, y, c2)

# Более того, ячейки даже не обязаны быть прямоугольными.

c3 = [[5, 1, 2, 1], [2, 8, 0, 2], [1, 0, 12, 1]]

x3 = [[4, 6, 8, 10, 12], [3, 5, 8, 11, 13], [2, 4, 8, 12, 14],
      [0, 6, 8, 10, 9]]

y3 = [0, 1, 2, 3]
ax[1][0].pcolormesh(x3, y3, c3)

c4 = [[5, 1, 2, 1], [2, 8, 0, 2], [1, 0, 12, 1]]

x4 = [[4, 6, 8, 10, 12], [3, 5, 8, 11, 13], [2, 4, 8, 12, 14],
      [3, 6, 8, 10, 13]]

y4 = [[0, -0.5, -1, -0.5, 0], [0.5, 1, 1, 1, 0.5], [1.5, 2, 2, 2, 1.5],
      [2.5, 3, 2.5, 3, 2.5]]

ax[1][1].pcolormesh(x4, y4, c4, alpha=0.5, edgecolor='r', linewidth=3)

fig.set(facecolor='floralwhite', figwidth=15, figheight=16)
plt.show()
